perf_test/results/recommend_profile_100_RPS.txt
Requests      [total, rate, throughput]         6000, 100.02, 99.48
Duration      [total, attack, wait]             59.99s, 59.986s, 3.824ms
Latencies     [min, mean, 50, 90, 95, 99, max]  554µs, 165.515ms, 3.651ms, 4.837ms, 5.323ms, 115.859ms, 30.011s
Bytes In      [total, mean]                     11959872, 1993.31
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           99.47%
Status Codes  [code:count]                      0:32  200:5968  
Error Set:
Get "http://localhost:8085/api/v0/recommend/home?limit=10": context deadline exceeded (Client.Timeout exceeded while awaiting headers)